Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/atdf/PIC32CZ2051CA80100.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x45800000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC08" ioset="1"/>
              <signal group="PAD" index="0" function="D" pad="PD11" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PC09" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PD12" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PC10" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PA04" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PC11" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PA03" ioset="2"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="9" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="10" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="23"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="25" caption="Instance index for SERCOM2"/>
              <param name="MCLK_ID_APB" value="33" caption="Index for SERCOM2 APB clock"/>
              <param name="PAC_ID" value="25" caption="Index for SERCOM2 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="69" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="71" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="72" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="73" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="71" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="72" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="73" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="69" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="73" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="74" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="75" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x45802000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC12" ioset="1"/>
              <signal group="PAD" index="0" function="D" pad="PD03" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PC13" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PD04" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PC14" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PD05" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PC15" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PD06" ioset="2"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="11" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="12" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="24"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="26" caption="Instance index for SERCOM3"/>
              <param name="MCLK_ID_APB" value="34" caption="Index for SERCOM3 APB clock"/>
              <param name="PAC_ID" value="26" caption="Index for SERCOM3 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="76" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="78" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="79" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="80" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="78" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="79" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="80" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="76" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="80" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="81" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="82" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
        </module>
        <module name="SPI_IXS" id="03574" name2="spi_ixs_apb_v1" version="1a0">
          <instance name="SPI_IXS0">
            <register-group name="SPI_IXS0" name-in-module="SPI_IXS" address-space="base" offset="0x46030000"/>
            <signals>
              <signal group="FSYNC" function="J" pad="PC00" ioset="1"/>
              <signal group="FSYNC" function="J" pad="PD02" ioset="2"/>
              <signal group="SCK" function="J" pad="PC01" ioset="1"/>
              <signal group="SCK" function="J" pad="PD04" ioset="2"/>
              <signal group="SDI" function="J" pad="PC02" ioset="1"/>
              <signal group="SDI" function="J" pad="PD03" ioset="2"/>
              <signal group="SDO" function="J" pad="PC03" ioset="1"/>
              <signal group="SDO" function="J" pad="PD05" ioset="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="79"/>
              <param name="DMAC_ID_TX" value="80"/>
              <param name="GCLK_ID" value="44" caption="Index of Generic Clock"/>
              <param name="TPD_MASTER" value="0" caption="Indicates a master or slave number for TPD mode( 1=master,0=slave)"/>
              <param name="INSTANCE_ID" value="46" caption="Instance index for SPI_IXS0"/>
              <param name="MCLK_ID_APB" value="54" caption="Index for SPI_IXS0 APB clock"/>
              <param name="PAC_ID" value="46" caption="Index for SPI_IXS0 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="SQI" id="04044" name2="sqi_ctlr_v4" version="4a0">
          <instance name="SQI0">
            <register-group name="SQI0" name-in-module="SQI" address-space="base" offset="0x4F008000"/>
            <signals>
              <signal group="CLK" function="H" pad="PC08"/>
              <signal group="CS" index="0" function="H" pad="PC13"/>
              <signal group="CS" index="1" function="H" pad="PC15"/>
              <signal group="DATA" index="0" function="H" pad="PC09"/>
              <signal group="DATA" index="1" function="H" pad="PC10"/>
              <signal group="DATA" index="2" function="H" pad="PC11"/>
              <signal group="DATA" index="3" function="H" pad="PC12"/>
            </signals>
            <parameters>
              <param name="CBUF_DEPTH" value="3"/>
              <param name="GCLK_ID" value="56" caption="Index of Generic Clock"/>
              <param name="SFR_ADDRESS" value="0x4f008000"/>
              <param name="TRXBUF_DEPTH" value="8"/>
              <param name="XIP_ADDRESS" value="0x80"/>
              <param name="XIP_CS_MSB" value="1"/>
              <param name="XIP_HSEL" value="0"/>
              <param name="INSTANCE_ID" value="57" caption="Instance index for SQI0"/>
              <param name="MCLK_ID_AHB" value="66" caption="Index for SQI0 AHB clock"/>
              <param name="PAC_ID" value="57" caption="Index for SQI0 registers write protection"/>
            </parameters>
          </instance>
        </module>
