Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/atdf/PIC32CZ2051CA80100.atdf
      <value-group name="XOSCCTRLA__CFDPRESC">
        <value name="DIV1" caption="48 MHz" value="0"/>
        <value name="DIV2" caption="24 MHz" value="1"/>
        <value name="DIV4" caption="12 MHz" value="2"/>
        <value name="DIV8" caption="6 MHz" value="3"/>
        <value name="DIV16" caption="3 MHz" value="4"/>
        <value name="DIV32" caption="1.5 MHz" value="5"/>
        <value name="DIV64" caption="0.75 MHz" value="6"/>
        <value name="DIV128" caption="0.3125 MHz" value="7"/>
      </value-group>
      <value-group name="XOSCCTRLA__USBHSDIV">
        <value name="DIS" caption="USBHS PLL reference XOSC clock is disabled" value="0x0"/>
        <value name="DIV1" caption="USBHS PLL reference XOSC clock is divided by 1" value="0x1"/>
        <value name="DIV2" caption="USBHS PLL reference XOSC clock is divided by 2" value="0x2"/>
        <value name="DIV3" caption="USBHS PLL reference XOSC clock is divided by 4" value="0x3"/>
      </value-group>
      <value-group name="PLL0CTRL__REFSEL">
        <value name="GCLK" caption="Dedicated GCLK clock reference" value="0x0"/>
        <value name="XOSC" caption="XOSC clock reference" value="0x1"/>
        <value name="DFLL48M" caption="DFLL48M clock reference" value="0x2"/>
      </value-group>
      <value-group name="PLL0CTRL__BWSEL">
        <value name="BWSEL0" caption="TBD" value="0x0"/>
        <value name="BWSEL1" caption="TBD" value="0x1"/>
        <value name="BWSEL2" caption="TBD" value="0x2"/>
        <value name="BWSEL3" caption="TBD" value="0x3"/>
        <value name="BWSEL4" caption="TBD" value="0x4"/>
        <value name="BWSEL5" caption="TBD" value="0x5"/>
        <value name="BWSEL6" caption="TBD" value="0x6"/>
        <value name="BWSEL7" caption="TBD" value="0x7"/>
      </value-group>
      <value-group name="PLL1CTRL__REFSEL">
        <value name="GCLK" caption="Dedicated GCLK clock reference" value="0x0"/>
        <value name="XOSC" caption="XOSC clock reference" value="0x1"/>
        <value name="DFLL48M" caption="DFLL48M clock reference" value="0x2"/>
      </value-group>
      <value-group name="PLL1CTRL__BWSEL">
        <value name="BWSEL0" caption="TBD" value="0x0"/>
        <value name="BWSEL1" caption="TBD" value="0x1"/>
        <value name="BWSEL2" caption="TBD" value="0x2"/>
        <value name="BWSEL3" caption="TBD" value="0x3"/>
        <value name="BWSEL4" caption="TBD" value="0x4"/>
        <value name="BWSEL5" caption="TBD" value="0x5"/>
        <value name="BWSEL6" caption="TBD" value="0x6"/>
        <value name="BWSEL7" caption="TBD" value="0x7"/>
      </value-group>
    </module>
    <module name="PAC" id="03585" name2="sec_pac_u2120_v2" version="2b0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="Bridge interrupt flag status">
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="DSU_" caption="DSU" mask="0x1"/>
          <bitfield name="FCW_" caption="FCW" mask="0x2"/>
          <bitfield name="FCR_" caption="FCR" mask="0x4"/>
          <bitfield name="PM_" caption="PM" mask="0x8"/>
          <bitfield name="SUPC_" caption="SUPC" mask="0x10"/>
          <bitfield name="RSTC_" caption="RSTC" mask="0x20"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL" mask="0x40"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL" mask="0x80"/>
          <bitfield name="GCLK_" caption="GCLK" mask="0x100"/>
          <bitfield name="MCLK_" caption="MCLK" mask="0x200"/>
          <bitfield name="FREQM_" caption="FREQM" mask="0x400"/>
          <bitfield name="WDT_" caption="WDT" mask="0x800"/>
          <bitfield name="RTC_" caption="RTC" mask="0x1000"/>
          <bitfield name="EIC_" caption="EIC" mask="0x2000"/>
          <bitfield name="PAC_" caption="PAC" mask="0x4000"/>
          <bitfield name="DRMTCM_" caption="DRMTCM" mask="0x8000"/>
          <bitfield name="MCRAMC_" caption="MCRAMC" mask="0x10000"/>
          <bitfield name="TRAM_" caption="TRAM" mask="0x20000"/>
          <bitfield name="PORT_" caption="PORT" mask="0x40000"/>
          <bitfield name="DMA_" caption="DMA" mask="0x80000"/>
          <bitfield name="PRM_" caption="PRM" mask="0x200000"/>
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x400000"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x800000"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x1000000"/>
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x2000000"/>
          <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x4000000"/>
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="TCC0_" caption="TCC0" mask="0x2"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x4"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x8"/>
          <bitfield name="TCC3_" caption="TCC3" mask="0x10"/>
          <bitfield name="TCC4_" caption="TCC4" mask="0x20"/>
          <bitfield name="TCC5_" caption="TCC5" mask="0x40"/>
          <bitfield name="TCC6_" caption="TCC6" mask="0x80"/>
          <bitfield name="TCC7_" caption="TCC7" mask="0x100"/>
          <bitfield name="TCC8_" caption="TCC8" mask="0x200"/>
          <bitfield name="TCC9_" caption="TCC9" mask="0x400"/>
          <bitfield name="ADC_" caption="ADC" mask="0x800"/>
          <bitfield name="AC_" caption="AC" mask="0x1000"/>
          <bitfield name="PTC_" caption="PTC" mask="0x2000"/>
          <bitfield name="SPI_IXS0_" caption="SPI_IXS0" mask="0x4000"/>
          <bitfield name="CAN0_" caption="CAN0" mask="0x10000"/>
          <bitfield name="CAN1_" caption="CAN1" mask="0x20000"/>
          <bitfield name="ETH_" caption="ETH" mask="0x1000000"/>
          <bitfield name="TRNG_" caption="TRNG" mask="0x8000000"/>
          <bitfield name="SDMMC0_" caption="SDMMC0" mask="0x10000000"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="MLB_" caption="MLB" mask="0x4"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x1"/>
          <bitfield name="FCW_" caption="FCW APB Protect Enable" mask="0x2"/>
          <bitfield name="FCR_" caption="FCR APB Protect Enable" mask="0x4"/>
          <bitfield name="PM_" caption="PM APB Protect Enable" mask="0x8"/>
          <bitfield name="SUPC_" caption="SUPC APB Protect Enable" mask="0x10"/>
          <bitfield name="RSTC_" caption="RSTC APB Protect Enable" mask="0x20"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Protect Enable" mask="0x40"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Protect Enable" mask="0x80"/>
          <bitfield name="GCLK_" caption="GCLK APB Protect Enable" mask="0x100"/>
          <bitfield name="MCLK_" caption="MCLK APB Protect Enable" mask="0x200"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x400"/>
          <bitfield name="WDT_" caption="WDT APB Protect Enable" mask="0x800"/>
          <bitfield name="RTC_" caption="RTC APB Protect Enable" mask="0x1000"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x2000"/>
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x4000"/>
          <bitfield name="DRMTCM_" caption="DRMTCM APB Protect Enable" mask="0x8000"/>
          <bitfield name="MCRAMC_" caption="MCRAMC APB Protect Enable" mask="0x10000"/>
          <bitfield name="TRAM_" caption="TRAM APB Protect Enable" mask="0x20000"/>
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x40000"/>
          <bitfield name="DMA_" caption="DMA APB Protect Enable" mask="0x80000"/>
          <bitfield name="PRM_" caption="PRM APB Protect Enable" mask="0x200000"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x400000"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x800000"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x1000000"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x2000000"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x4000000"/>
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge B">
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x2"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x4"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x8"/>
          <bitfield name="TCC3_" caption="TCC3 APB Protect Enable" mask="0x10"/>
          <bitfield name="TCC4_" caption="TCC4 APB Protect Enable" mask="0x20"/>
          <bitfield name="TCC5_" caption="TCC5 APB Protect Enable" mask="0x40"/>
          <bitfield name="TCC6_" caption="TCC6 APB Protect Enable" mask="0x80"/>
          <bitfield name="TCC7_" caption="TCC7 APB Protect Enable" mask="0x100"/>
          <bitfield name="TCC8_" caption="TCC8 APB Protect Enable" mask="0x200"/>
          <bitfield name="TCC9_" caption="TCC9 APB Protect Enable" mask="0x400"/>
          <bitfield name="ADC_" caption="ADC APB Protect Enable" mask="0x800"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x1000"/>
          <bitfield name="PTC_" caption="PTC APB Protect Enable" mask="0x2000"/>
          <bitfield name="SPI_IXS0_" caption="SPI_IXS0 APB Protect Enable" mask="0x4000"/>
          <bitfield name="CAN0_" caption="CAN0 APB Protect Enable" mask="0x10000"/>
          <bitfield name="CAN1_" caption="CAN1 APB Protect Enable" mask="0x20000"/>
          <bitfield name="ETH_" caption="ETH APB Protect Enable" mask="0x1000000"/>
          <bitfield name="SQI0_" caption="SQI0 APB Protect Enable" mask="0x2000000"/>
          <bitfield name="TRNG_" caption="TRNG APB Protect Enable" mask="0x8000000"/>
          <bitfield name="SDMMC0_" caption="SDMMC0 APB Protect Enable" mask="0x10000000"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000038" caption="Peripheral write protection status - Bridge C">
          <bitfield name="MLB_" caption="MLB APB Protect Enable" mask="0x4"/>
        </register>
      </register-group>
      <value-group name="WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
